#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: @logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113501641269]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113501641268]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113501641271]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113501641278]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113501641272]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113501641270]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113402076881]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113501641280]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113501641277]
sakuracloud_disk.k8s_lb_disk[1]: Refreshing state... [id=113501641276]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113501641274]
sakuracloud_disk.k8s_lb_disk[0]: Refreshing state... [id=113501641275]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113501641283]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113501641279]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113501641285]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113501641284]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113501641292]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15321]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113501641326]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113501641310]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113501641325]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113501641312]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113501641311]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113501641328]
sakuracloud_server.k8s_lb[1]: Refreshing state... [id=113501641294]
sakuracloud_server.k8s_lb[0]: Refreshing state... [id=113501641295]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501641283" -> (known after apply)
        name              = "k8s-control-plane-1-dev"
      ~ server_id         = "113501641325" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501641285" -> (known after apply)
        name              = "k8s-control-plane-2-dev"
      ~ server_id         = "113501641326" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501641284" -> (known after apply)
        name              = "k8s-control-plane-3-dev"
      ~ server_id         = "113501641328" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_lb_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_lb_disk" {
      ~ id                = "113501641275" -> (known after apply)
        name              = "k8s-lb-1-dev"
      ~ server_id         = "113501641295" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_lb_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_lb_disk" {
      ~ id                = "113501641276" -> (known after apply)
        name              = "k8s-lb-2-dev"
      ~ server_id         = "113501641294" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                = "113501641274" -> (known after apply)
        name              = "k8s-router-1-dev"
      ~ server_id         = "113501641292" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501641279" -> (known after apply)
        name              = "k8s-worker-node-1-dev"
      ~ server_id         = "113501641311" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501641277" -> (known after apply)
        name              = "k8s-worker-node-2-dev"
      ~ server_id         = "113501641310" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501641280" -> (known after apply)
        name              = "k8s-worker-node-3-dev"
      ~ server_id         = "113501641312" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501641283",
        ] -> (known after apply)
        id               = "113501641325"
        name             = "k8s-control-plane-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501641285",
        ] -> (known after apply)
        id               = "113501641326"
        name             = "k8s-control-plane-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501641284",
        ] -> (known after apply)
        id               = "113501641328"
        name             = "k8s-control-plane-3-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_lb[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_lb" {
      ~ disks            = [
          - "113501641275",
        ] -> (known after apply)
        id               = "113501641295"
        name             = "k8s-lb-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_lb[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_lb" {
      ~ disks            = [
          - "113501641276",
        ] -> (known after apply)
        id               = "113501641294"
        name             = "k8s-lb-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks            = [
          - "113501641274",
        ] -> (known after apply)
        id               = "113501641292"
        name             = "k8s-router-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501641279",
          - "113501641272",
        ] -> (known after apply)
        id               = "113501641311"
        name             = "k8s-worker-node-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501641277",
          - "113501641278",
        ] -> (known after apply)
        id               = "113501641310"
        name             = "k8s-worker-node-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501641280",
          - "113501641271",
        ] -> (known after apply)
        id               = "113501641312"
        name             = "k8s-worker-node-3-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 9 to add, 9 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>